tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "readline"
brew "sqlite"
brew "autopep8"
brew "bazel"
brew "black"
brew "buildifier"
brew "capnp"
brew "chezmoi"
brew "cmake"
brew "code-server"
brew "git-crypt"
brew "glances"
brew "nettle"
brew "gnutls"
brew "gnupg"
brew "go"
brew "htop"
brew "ipython"
brew "rust"
brew "maturin"
brew "mono"
brew "node"
brew "openblas"
brew "openjdk"
brew "pipx"
brew "poetry"
brew "protobuf"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "rustfmt"
brew "rustup-init"
brew "screenfetch"
brew "subversion"
brew "tmux"
brew "typescript"
brew "vim"
brew "wget"
brew "yarn"
cask "adoptopenjdk"
cask "alt-tab"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "cheatsheet"
cask "clashx"
cask "daisydisk"
cask "discord"
cask "docker"
cask "font-ubuntu-mono-derivative-powerline"
cask "google-chrome"
cask "insync"
cask "intel-power-gadget"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "logi-options-plus"
cask "logitech-options"
cask "logitech-unifying"
cask "macvim"
cask "moom"
cask "nextcloud"
cask "notion"
cask "pdf-expert"
cask "postman"
cask "raycast"
cask "sound-control"
cask "telegram-desktop"
cask "tencent-meeting"
cask "termius"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
cask "zoom"
cask "zotero"
