tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "black"
brew "bottom"
brew "cmake"
brew "dust"
brew "exa"
brew "fd"
brew "git-crypt"
brew "grex"
brew "helix"
brew "htop"
brew "mackup"
brew "node"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust-analyzer"
brew "sk"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "you-get"
brew "zellij"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "alt-tab"
cask "balenaetcher"
cask "bartender"
cask "clashx"
cask "daisydisk"
cask "font-ubuntu-mono-derivative-powerline"
cask "google-chrome"
cask "insync"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lark"
cask "logi-options-plus"
cask "macvim"
cask "nextcloud"
cask "notion"
cask "pdf-expert"
cask "postman"
cask "powerphotos"
cask "raycast"
cask "sound-control"
cask "stats"
cask "telegram-desktop"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"
cask "zotero"
