tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "black"
brew "bottom"
brew "cmake"
brew "dotter"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "git-crypt"
brew "gitui"
brew "gnupg"
brew "grex"
brew "helix"
brew "htop"
brew "just"
brew "mackup"
brew "node"
brew "nushell"
brew "ouch"
brew "pnpm"
brew "postgresql@14"
brew "protobuf"
brew "ripgrep"
brew "rust-analyzer"
brew "rye"
brew "sd"
brew "sk"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "you-get"
brew "zellij"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "alt-tab"
cask "balenaetcher"
cask "daisydisk"
cask "discord"
cask "element"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "insync"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lark"
cask "logi-options-plus"
cask "mactex"
cask "macvim"
cask "notion"
cask "pdf-expert"
cask "postman"
cask "qqmusic"
cask "rar"
cask "raycast"
cask "sony-ps-remote-play"
cask "sound-control"
cask "stats"
cask "telegram-desktop"
cask "texifier"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "warp"
cask "xquartz"
cask "zoom"
cask "zotero"
vscode "a5huynh.vscode-ron"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "bazelbuild.vscode-bazel"
vscode "bierner.markdown-emoji"
vscode "byted-ide.authenticator"
vscode "byted-ide.cloud-workspace"
vscode "byted-ide.gallery"
vscode "cduruk.thrift"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dongfg.vscode-beancount-formatter"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "idleberg.applescript"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "kdl-org.kdl"
vscode "kevinrose.vsc-python-indent"
vscode "lencerf.beancount"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mine.cpplint"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mutantdino.resourcemonitor"
vscode "njpwerner.autodocstring"
vscode "nomicfoundation.hardhat-solidity"
vscode "rust-lang.rust-analyzer"
vscode "ryzngard.vscode-header-source"
vscode "sclu1034.justfile"
vscode "silverquark.dancehelix"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "xmonader.vscode-capnp"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
